lioncore/metametamodel.puml
@startuml


abstract class AbstractConcept extends MetamodelElement implements FeaturesContainer, NamespaceProvider {
  allFeatures(): List<Feature>
}

class Annotation extends AbstractConcept {
  platformSpecific: String?
}

class Concept extends AbstractConcept {
  abstract: boolean
}

class ConceptInterface extends AbstractConcept

class Containment extends Link

abstract class DataType extends MetamodelElement

abstract class Feature implements NamespacedEntity {
  derived: boolean
  optional: boolean
}

interface FeaturesContainer

abstract class Link extends Feature {
  multiple: boolean
}

class Metamodel implements NamespaceProvider {
  qualifiedName: String
}

abstract class MetamodelElement implements NamespacedEntity

interface NamespaceProvider {
  namespaceQualifier(): String
}

interface NamespacedEntity {
  simpleName: String
  qualifiedName(): String
}

class PrimitiveType extends DataType

class Property extends Feature

class Reference extends Link

class Enumeration extends DataType implements NamespaceProvider

class EnumerationLiteral implements NamespacedEntity

class Typedef extends DataType


' relations:

Annotation "*" -- "1" AbstractConcept: target

Concept "*" -- "0..1" Concept: extends
Concept "*" -- "*" ConceptInterface: implements

ConceptInterface "*" -- "*" ConceptInterface: extends

Containment "*" -- "0..1" Containment: specializes

FeaturesContainer "1" o-- "*" Feature: features

Link "*" -- "1" AbstractConcept: type

Metamodel "1" o-- "*" MetamodelElement: elements
Metamodel "*" -- "*" Metamodel: dependsOn

NamespacedEntity "*" -- "1" NamespaceProvider: container

Property "*" -- "1" DataType: type

Reference "*" -- "0..1" Reference: specializes

Enumeration "*" -- "*" EnumerationLiteral: literals

Typedef "*" -- "1" PrimitiveType: constraints



@enduml
